""""
№1
Создать бота через BotFather.
Повторить код с урока.
В случае если пустой message handler
принимает число, он должен отправлять
его же возведенное в квадрат. Иначе отправляет
тоже самое (эхо).
Создать функцию для отправки файлов.

№2

Домашнее задание ( есть доп задание ):

К викторинам, которые уже существуют,
добавить Callback (Очередность вопросов с помощью кнопок).
ответов должно быть по 3 продолжения
Создать команду game, при вызове которой бот
 кинет игральной кости для бота.

Список с играми - ['⚽', '🎰', '🏀', '🎯', '🎳', '🎲']

# Команда должна реагировать на слово “game”, внутри
функции echo(как и возведение в степень в дз-1).

# Не создавать отдельную функцию для этой команды!

# Подсказка: игры отправляются методом send_ ….


Доп задание 😈:

Усовершенствование команду game, при вызове которой
бот кинет игральной кости для бота и для игрока.
Бот должен определить победителя.
.

№ 3

Домашнее задание ():

Сделать FSM для интернет магазина.
Спрашивать такие данные как: название
модели, размер, категория, стоимость
и фотка товара.

№4


Домашнее задание (есть два доп задание 😈🔥 ):

Создать таблицу products_details со столбацами:
id, productid, category, infoproduct.
Скопировать FSM с урока.
Добавить стадию “category” и “info_product”.
Записать категорию и информацию о продукте в
отдельную таблицу products_details вместе с productid.


Доп Задание 😈

Сделать вывод продуктов из базы (вместе с фоткой).
Сделать вывод по одному товару.
Добавить inline кнопку далее, после нажатия которого
выведется следующий товар.


Доп Задание + 🔥

Поставить крон на 9:00 и на 19:00 в это время
должны приходить уведомление админу. В виде
уведомлений должны приходить товары
(все товары разом).
...Свернуть



№ 5

Домашнее задание(есть доп задание 😈):

Создать таблицу collection_products
( id, productid, collection)
В fsm добавить стадию collection.
Записать в таблицу collection_products
 вместе с productid.


Доп Задание:

Сделать вывод продуктов из базы (вместе с фоткой).
Сделать вывод по одному товару.
Добавить inline кнопку далее, после нажатия
которого выведется следующий товар.
"""